<?php

namespace Game\Report;

class GlobeBet extends \Game\GlobeBet
{
	function __construct()
	{
		parent::__construct();
	}
	
	public function set_report($sdate, $edate)
	{
		$result = $this->get_report($sdate, $edate);

		if($result['data'] ?? 0){

			$report = $result['data'];
			$insert = [];
			
			$tool = \App::make('Game\Account')->init($this->_lib);
			foreach($report as $val){
				$info = json_encode($val, JSON_UNESCAPED_UNICODE);
				$account = $val['MemberID'];
				$member_id = $tool->get($account)->member_id ?? 0;
			
				$insert[] = [
					'report_uid' => $val['BetID'],//單號
					'bet_date' => strtotime($val['BetDT']),//投注時間
					'set_date' => strtotime($val['SettleDT']),//結帳時間
					'bet_amount' => $val['InitBetAmt']/100,//投注金額
					'set_amount' => $val['RealBetAmt']/100,//有效投注
					'win_amount' => isset($val['WLAmt'])? ($val['WLAmt'] + $val['RefundAmt'] - $val['RealBetAmt'])/100: 0,// 輸贏結果 WLAmt+RefundAmt-RealBetAmt
					'type_id' => isset($val['WLAmt'])? $val['BetResult']+1: 1,//1贏 2輸 3和
					'info' => $info,//原始資料 json_encode
					'member_id' => $member_id,
					'account' => $account,//遊戲帳號
				];
			}
			\App::make('Lib\Mix')->insert_duplicate('t_report_globebet', $insert);
		}
	}

	public function get_report($sdate, $edate)
	{
		$branch = \DB::table('t_branch')->where('id', '!=', 1)->get();
		
		$result = [];
		
		foreach($branch as $val){
			// init with branch_id
			$this->init($val->id);
			
			$data = $this->_get_report($val->id);
			$result = array_merge($result, $data['data']);
		}
		
		return ['code' => 0, 'data' => $result];
	}
	
	public function _get_report($branch_id)
	{
		$sid = 1;
		$eid = -1;
		
		$r = \DB::table('t_report_globebet')
			->select('t_report_globebet.*')
			->join('t_member', 't_member.id', '=', 't_report_globebet.member_id')
			->where('t_member.branch_id', $branch_id)
			->orderBy('id', 'desc')
			->first();
		$r = json_decode($r->info ?? '', true) ?? 0;
		//$bsid = $r['BetID'] ?? 1;
		$ssid = $r['SettleID'] ?? $r['BetID'] ?? 1;
		
		// maxid may be affected
		//$result1 = @$this->__get_report($bsid, $eid, 'betting');
		$result2 = @$this->__get_report($ssid, $eid, 'settle');
		
		$result = array_merge($result1['data'] ?? [], $result2['data'] ?? []);
		
		return ['code' => 0, 'data' => $result];
	}
	
	public function __get_report($sid, $eid, $type)
	{
		if($type == 'betting'){
			$post = [
				'GB' => [
					'Method' => 'GetGamingBetting',
					'TPCode' => $this->api['_tpcode'],
					'AuthKey' => $this->api['_generalkey'],
					'Params' => [
						'StartBetID' => $sid,
						'EndBetID' => $eid,
					],
				],
			];
			$dt = 'BettingList';
		}else if($type == 'settle'){
			$post = [
				'GB' => [
					'Method' => 'GetGamingSettle',
					'TPCode' => $this->api['_tpcode'],
					'AuthKey' => $this->api['_generalkey'],
					'Params' => [
						'StartSettleID' => $sid,
						'EndSettleID' => $eid,
					],
				],
			];
			$dt = 'SettleList';
		}
		else{
			return ['code' => 7, 'text' => ''];
		}

		$result = \App::make('Lib\Curl')->curl($this->api['_url'], json_encode($post));
		$result = json_decode($result, true);

		if(($result['GB']['Result']['Success'] ?? null) === 1){
			return ['code' => 0, 'data' => $result['GB']['Result']['ReturnSet'][$dt] ?? []];
		}else{ //錯誤回傳
			return ['code' => 7, 'text' => ''];
		}
	}

	public static function get_game($info)
	{
		$srccode = $info['KenoList']['0']['SrcCode'] ?? $info['LottoList']['0']['SrcCode'] ?? $info['SscList']['0']['SrcCode'] ?? $info['PkxList']['0']['SrcCode'] ?? 0;
		
		$type =[
			1 => '北京', 2 => '俄勒岡', 3 => '斯洛伐克', 4 => '加拿大西部', 5 => '加拿大卑斯', 7 => '馬耳它', 8 => '香港六合彩', 9 => '中國七樂彩',
			11 => '新西蘭樂透', 12 => '德國樂透', 14 => '西班牙樂透', 15 => '南非國家樂透', 16 => '加拿大樂透', 17 => '美國紐約樂透', 19 => '新加坡多多',
			20 => '極速', 21 => '高頻', 22 => '澳洲', 23 => '福彩3D', 24 => '上海時時彩', 25 => '重慶時時彩', 27 => '天津時時彩', 28 => '新疆時時彩', 29 => '極速',
			30 => '高頻', 32 => '超級', 34 => '極速', 35 => '高頻', 38 => '北京PK拾', 39 => '極速PK拾',
			40 => '高頻PK拾',
		];

		return $type[(int)$srccode] ?? $srccode;
	}

	public static function create_bet_content_column($info, $tpl)
	{
		$info = json_decode(json_encode($info), true);
		
		if($info['KenoList'] ?? 0){
			$result = self::get_keno($info);
		}
		if($info['LottoList'] ?? 0){
			$result = self::get_lotto($info);
		}
		if($info['SscList'] ?? 0){
			$result = self::get_ssc($info);
		}
		if($info['PkxList'] ?? 0){
			$result = self::get_pkx($info);
		}
		
		$html3 = $tpl->block('globebet_bet_content')->assign([
			'drawno' => $result['drawno'] ?? '',
			'play' => $result['play'] ?? '',
			'content' => $result['content'] ?? '',
		])->render(false);
		
		return $html3;
	}

	public static function get_pkx($info)
	{
		$type = [
			101 => '冠軍,名次定位', 102 => '亞軍,名次定位', 103 => '季軍,名次定位', 104 => '第四名,名次定位', 105 => '第五名,名次定位', 106 => '第六名,名次定位', 107 => '第七名,名次定位', 108 => '第八名,名次定位', 109 => '第九名,名次定位',
			110 => '第十名,名次定位', 121 => '冠軍小,名次大小', 122 => '冠軍大,名次大小', 123 => '亞軍小,名次大小', 124 => '亞軍大,名次大小', 125 => '季軍小,名次大小', 126 => '季軍大,名次大小', 127 => '第四名小,名次大小', 128 => '第四名大,名次大小', 129 => '第五名小,名次大小',
			130 => '第五名大,名次大小', 131 => '第六名小,名次大小', 132 => '第六名大,名次大小', 133 => '第七名小,名次大小', 134 => '第七名大,名次大小', 135 => '第八名小,名次大小', 136 => '第八名大,名次大小', 137 => '第九名小,名次大小', 138 => '第九名大,名次大小', 139 => '第十名小,名次大小',
			140 => '第十名大,名次大小', 141 => '冠軍單,名次單雙', 142 => '冠軍雙,名次單雙', 143 => '亞軍單,名次單雙', 144 => '亞軍雙,名次單雙', 145 => '季軍單,名次單雙', 146 => '季軍雙,名次單雙', 147 => '第四名單,名次單雙', 148 => '第四名雙,名次單雙', 149 => '第五名單,名次單雙',
			150 => '第五名雙,名次單雙', 151 => '第六名單,名次單雙', 152 => '第六名雙,名次單雙', 153 => '第七名單,名次單雙', 154 => '第七名雙,名次單雙', 155 => '第八名單,名次單雙', 156 => '第八名雙,名次單雙', 157 => '第九名單,名次單雙', 158 => '第九名雙,名次單雙', 159 => '第十名單,名次單雙',
			160 => '第十名雙,名次單雙',
			201 => '冠軍龍,龍虎定位', 202 => '冠軍虎,龍虎定位', 203 => '亞軍龍,龍虎定位', 204 => '亞軍虎,龍虎定位', 205 => '季軍龍,龍虎定位', 206 => '季軍虎,龍虎定位', 207 => '第四名龍,龍虎定位', 208 => '第四名虎,龍虎定位', 209 => '第五名龍,龍虎定位',
			210 => '第五名虎,龍虎定位', 211 => '龍多,龍多虎多', 212 => '虎多,龍多虎多',
			221 => '全龍,全龍全虎', 222 => '全虎,全龍全虎',
			303 => '3,冠亞和值', 304 => '4,冠亞和值', 305 => '5,冠亞和值', 306 => '6,冠亞和值', 307 => '7,冠亞和值', 308 => '8,冠亞和值', 309 => '9,冠亞和值',
			310 => '10,冠亞和值', 311 => '11,冠亞和值', 312 => '12,冠亞和值', 313 => '13,冠亞和值', 314 => '14,冠亞和值', 315 => '15,冠亞和值', 316 => '16,冠亞和值', 317 => '17,冠亞和值', 318 => '18,冠亞和值', 319 => '19,冠亞和值',
			321 => '小,冠亞和大小', 322 => '大,冠亞和大小', 331 => '單,冠亞和單雙', 332 => '雙,冠亞和單雙', 341 => '青龍,冠亞和組合', 342 => '白虎,冠亞和組合', 343 => '朱雀,冠亞和組合', 344 => '玄武,冠亞和組合',
		];

		$str = $type[(int)($info['PkxList']['0']['OptCode'] ?? 0)] ?? '';
		$arr = explode(',', $str);

		$result =[
			'drawno' => $info['PkxList']['0']['DrawNo'] ?? '',
			'play' => $arr[1] ?? '',
			'content' => ($arr[0] ?? '') . '(' . ($info['PkxList']['0']['OptParam'] ?? 0) . ')',
		];

		return $result;
	}

	public static function get_lotto($info)
	{
		$type = [
			1 => '特碼,特碼', 2 => '正1特,正碼特', 3 => '正2特,正碼特', 4 => '正3特,正碼特', 5 => '正4特,正碼特', 6 => '正5特,正碼特', 7 => '正6特,正碼特', 8 => '平碼,平碼', 9 => '4全中,連碼',
			10 => '3全中,連碼', 11 => '3中2,連碼', 12 => '2全中,連碼', 13 => '2中特,連碼', 14 => '特串,連碼', 15 => '特肖,生肖', 16 => '正肖,生肖', 17 => '一肖,生肖', 18 => '大,兩面', 19 => '小,兩面',
			20 => '單,兩面', 21 => '雙,兩面', 22 => '尾大,兩面', 23 => '尾小,兩面', 24 => '大肖,兩面', 25 => '小肖,兩面', 26 => '合大,兩面', 27 => '合小,兩面', 28 => '合單,兩面', 29 => '合雙,兩面',
			30 => '總和大,兩面', 31 => '總和小,兩面', 32 => '總和單,兩面', 33 => '總和雙,兩面', 34 => '大,正碼1-6', 35 => '小,正碼1-6', 36 => '單,正碼1-6', 37 => '雙,正碼1-6', 38 => '合大,正碼1-6', 39 => '合小,正碼1-6',
			40 => '合單,正碼1-6', 41 => '合雙,正碼1-6', 42 => '尾大,正碼1-6', 43 => '尾小,正碼1-6', 44 => '大肖,正碼1-6', 45 => '小肖,正碼1-6', 46 => '紅,正碼1-6', 47 => '藍,正碼1-6', 48 => '綠,正碼1-6', 49 => '大,正碼1-6',
			50 => '小,正碼1-6', 51 => '單,正碼1-6', 52 => '單雙,正碼1-6', 53 => '合大,正碼1-6', 54 => '合小,正碼1-6', 55 => '合單,正碼1-6', 56 => '合雙,正碼1-6', 57 => '尾大,正碼1-6', 58 => '尾小,正碼1-6', 59 => '大肖,正碼1-6',
			60 => '小肖,正碼1-6', 61 => '紅,正碼1-6', 62 => '藍,正碼1-6', 63 => '綠,正碼1-6', 64 => '大,正碼1-6', 65 => '小,正碼1-6', 66 => '單,正碼1-6', 67 => '雙,正碼1-6', 68 => '合大,正碼1-6', 69 => '合小,正碼1-6',
			70 => '合單,正碼1-6', 71 => '合雙,正碼1-6', 72 => '尾大,正碼1-6', 73 => '尾小,正碼1-6', 74 => '大肖,正碼1-6', 75 => '小肖,正碼1-6', 76 => '紅,正碼1-6', 77 => '藍,正碼1-6', 78 => '綠,正碼1-6', 79 => '大,正碼1-6',
			80 => '小,正碼1-6', 81 => '單,正碼1-6', 82 => '雙,正碼1-6', 83 => '合大,正碼1-6', 84 => '合小,正碼1-6', 85 => '合單,正碼1-6', 86 => '合雙,正碼1-6', 87 => '尾大,正碼1-6', 88 => '尾小,正碼1-6', 89 => '大肖,正碼1-6',
			90 => '小肖,正碼1-6', 91 => '紅,正碼1-6', 92 => '藍,正碼1-6', 93 => '綠,正碼1-6', 94 => '大,正碼1-6', 95 => '小,正碼1-6', 96 => '單,正碼1-6', 97 => '雙,正碼1-6', 98 => '合大,正碼1-6', 99 => '合小,正碼1-6',
			100 => '合單,正碼1-6', 101 => '合雙,正碼1-6', 102 => '尾大,正碼1-6', 103 => '尾小,正碼1-6', 104 => '大肖,正碼1-6', 105 => '小肖,正碼1-6', 106 => '紅,正碼1-6', 107 => '藍,正碼1-6', 108 => '綠,正碼1-6', 109 => '大,正碼1-6',
			110 => '小,正碼1-6', 110 => '單,正碼1-6', 112 => '雙,正碼1-6', 113 => '合大,正碼1-6', 114 => '合小,正碼1-6', 115 => '合單,正碼1-6', 116 => '合雙,正碼1-6', 117 => '尾大,正碼1-6', 118 => '尾小,正碼1-6', 119 => '大肖,正碼1-6',
			120 => '小肖,正碼1-6', 121 => '紅,正碼1-6', 122 => '藍,正碼1-6', 123 => '綠,正碼1-6', 124 => '紅,正碼1-6', 125 => '藍,正碼1-6', 126 => '綠,正碼1-6', 127 => '红大,色波', 128 => '红小,色波', 129 => '紅單,色波',
			130 => '紅雙,色波', 131 => '藍大,色波', 132 => '藍小,色波', 133 => '藍單,色波', 134 => '藍雙,色波', 135 => '綠大,色波', 136 => '綠小,色波', 137 => '綠單,色波', 138 => '綠雙,色波', 139 => '紅大單,色波',
			140 => '紅大雙,色波', 141 => '紅小單,色波', 142 => '紅小雙,色波', 143 => '藍大單,色波', 144 => '藍大雙,色波', 145 => '藍小單,色波', 146 => '藍小雙,色波', 147 => '綠大單,色波', 148 => '綠大雙,色波', 149 => '綠小單,色波',
			150 => '綠小雙,色波', 151 => '頭0,頭尾數', 152 => '頭1,頭尾數', 153 => '頭2,頭尾數', 154 => '頭3,頭尾數', 155 => '頭4,頭尾數', 156 => '尾0,頭尾數', 157 => '尾1,頭尾數', 158 => '尾2,頭尾數', 159 => '尾3,頭尾數',
			160 => '尾4,頭尾數', 161 => '尾5,頭尾數', 162 => '尾6,頭尾數', 163 => '尾7,頭尾數', 164 => '尾8,頭尾數', 165 => '尾9,頭尾數', 166 => '尾0,頭尾數', 167 => '尾1,頭尾數', 168 => '尾2,頭尾數', 169 => '尾3,頭尾數',
			170 => '尾4,頭尾數', 171 => '尾5,頭尾數', 172 => '尾6,頭尾數', 173 => '尾7,頭尾數', 174 => '尾8,頭尾數', 175 => '尾9,頭尾數', 176 => '28 ~ 110,總分', 177 => '111 ~ 140,總分', 178 => '141 ~ 170,總分', 179 => '171 ~ 200,總分',
			180 => '201 ~ 230,總分', 181 => '231 ~ 322,總分', 182 => '二肖連,連肖', 183 => '三肖連,連肖', 184 => '四肖連,連肖', 185 => '五肖連,連肖', 186 => '五不中,多選不中', 187 => '六不中,多選不中', 188 => '七不中,多選不中', 189 => '八不中,多選不中',
			190 => '九不中,多選不中', 191 => '十不中,多選不中', 192 => '五中一,多選中一', 193 => '六中一,多選中一', 194 => '七中一,多選中一', 195 => '八中一,多選中一', 196 => '九中一,多選中一', 197 => '十中一,多選中一',
		];

		$str = $type[(int)($info['LottoList']['0']['OptCode'] ?? 0)] ?? '';
		$arr = explode(',', $str);

		$result =[
			'drawno' => $info['LottoList']['0']['DrawNo'] ?? '',
			'play' => $arr[1] ?? '',
			'content' => $arr[0] ?? '',
		];

		return $result;
	}

	public static function get_keno($info)
	{		
		$type = [
			1 => '正賭,珠仔', 2 => '反賭,珠仔', 3 => '全中,珠仔', 4 => '中更多,珠仔', 5 => '上,上下', 6 => '中,上下', 7 => '下,上下', 8 => '大,大小', 9 => '和,大小',
			10 => '小,大小', 11 => '單,單雙', 12 => '雙,單雙', 13 => '小單,大小單雙', 14 => '大單,大小單雙', 15 => '大雙,大小單雙', 16 => '小雙,大小單雙', 17 => '奇,奇偶', 18 => '和,奇偶', 19 => '偶,奇偶',
			20 => '金,五行', 21 => '木,五行', 22 => '水,五行', 23 => '火,五行', 24 => '土,五行', 25 => '大,大小指數', 26 => '小,大小指數',
		];
		
		$str = $type[(int)($info['KenoList']['0']['OptCode'] ?? 0)] ?? '';
		$arr = explode(',', $str);

		$result =[
			'drawno' =>  $info['KenoList']['0']['DrawNo'] ?? '',
			'play' => $arr[1] ?? '',
			'content' => $arr[0] ?? '',
		];

		return $result;
	}

	public static function get_ssc($info)
	{
		$arr = explode(';', $info['SscList']['0']['SPV'] ?? '');
		
		$str =  '';
		$str .= (($arr[2] ?? -1)==-1)? '': ('萬:' . $arr[2]);
		$str .= (($arr[3] ?? -1)==-1)? '': ('千:' . $arr[3]);
		$str .= (($arr[4] ?? -1)==-1)? '': ('百:' . $arr[4]);
		$str .= (($arr[5] ?? -1)==-1)? '': ('十:' . $arr[5]);
		$str .= (($arr[6] ?? -1)==-1)? '': ('個:' . $arr[6]);
		
		$type = ['Y' => '分位', 'N' => '組選', 'B' => '大', 'S' => '小', 'E' => '單', 'O' => '雙', '1' => '紅', '2' => '橙', '3' => '黃', '4' => '綠', '5' => '藍', '6' => '靛', '7' => '紫',];
		$str .= ($type[$arr[1] ?? 0] ?? '');
		
		$type = ['X' => '', '1' => '萬:', '2' => '千:', '3' => '百:', '4' => '十:', '5' => '個:', 'F' => '前三或前二', 'M' => '中三', 'B' => '後三或後二',];
		$str = ($type[substr($arr[0], -1)] ?? '') . $str;
		
		$type = ['XX' => '珠仔', 'XM' => '珠仔單雙', 'XZ' => '珠仔大小', 'G2' => '二星組選', 'G3' => '三星組選三', 'G6' => '三星組選六', 'SS' => '和值', 'SR' => '和值七彩', 'SM' => '和值單雙', 'SZ' => '和值大小',];
		$result =[
			'drawno' => $info['SscList']['0']['DrawNo'] ?? '',
			'play' => $type[substr($arr[0], 0, -1)] ?? '',
			'content' => $str ?? '',
		];

		return $result;
	}
}
